{
  "interval": {
    "intervalStart": "2026-01-18T00:00:00.000Z",
    "intervalEnd": "2026-01-25T00:00:00.000Z",
    "intervalType": "week"
  },
  "repository": "elizaos-plugins/plugin-openrouter",
  "overview": "From 2026-01-18 to 2026-01-25, elizaos-plugins/plugin-openrouter had 0 new PRs (0 merged), 0 new issues, and 5 active contributors.",
  "topIssues": [],
  "topPRs": [],
  "codeChanges": {
    "additions": 0,
    "deletions": 0,
    "files": 0,
    "commitCount": 0
  },
  "completedItems": [],
  "topContributors": [
    {
      "username": "madjin",
      "avatarUrl": "https://avatars.githubusercontent.com/u/32600939?u=cdcf89f44c7a50906c7a80d889efa85023af2049&v=4",
      "totalScore": 109.19647689935744,
      "prScore": 89.45647689935743,
      "issueScore": 14.2,
      "reviewScore": 5,
      "commentScore": 0.54,
      "summary": "madjin: Focused on stabilizing the documentation site's data pipeline by identifying and resolving critical issues related to missing API files and null contributor summaries (#225, #226, #228). They successfully merged a fix to ensure stats are correctly re-exported after summary generation (#229) and addressed edge cases where no-activity days caused generation failures. Their work primarily centered on bug fixes and configuration improvements to ensure the reliability of the site's automated reporting and API indexing."
    },
    {
      "username": "0xbbjoker",
      "avatarUrl": "https://avatars.githubusercontent.com/u/54844437?u=90fe1762420de6ad493a1c1582f1f70c0d87d8e2&v=4",
      "totalScore": 109.08471056386475,
      "prScore": 109.08471056386475,
      "issueScore": 0,
      "reviewScore": 0,
      "commentScore": 0,
      "summary": "0xbbjoker: Focused on maintaining ecosystem stability and version alignment, notably resolving TypeScript compatibility errors for @elizaos/core 1.7.x in the Telegram plugin via PR #24. They also managed the release preparation for the Discord plugin, executing a version bump that involved significant code and configuration updates across 27 files in PR #44. Their work this week primarily centered on bug fixes and configuration management to ensure seamless integration across core plugin repositories."
    },
    {
      "username": "hanzlamateen",
      "avatarUrl": "https://avatars.githubusercontent.com/u/10975502?u=53f23921078d9a27d96751373bb44f4bd2d58bf4&v=4",
      "totalScore": 92.37709407952083,
      "prScore": 92.37709407952083,
      "issueScore": 0,
      "reviewScore": 0,
      "commentScore": 0,
      "summary": null
    },
    {
      "username": "odilitime",
      "avatarUrl": "https://avatars.githubusercontent.com/u/16395496?u=c9bac48e632aae594a0d85aaf9e9c9c69b674d8b&v=4",
      "totalScore": 44.083773896576105,
      "prScore": 43.5437738965761,
      "issueScore": 0,
      "reviewScore": 0,
      "commentScore": 0.54,
      "summary": "odilitime: Focused on a massive architectural overhaul of the elizaos/eliza core, specifically working on the V2.0.0 dynamic execution engine as seen in PR #6384. This high-impact effort involved substantial code modifications across over 1,800 files, totaling more than 100,000 lines of changes to test context-driven execution logic. Their work this week was primarily dedicated to large-scale bugfixes and feature development aimed at stabilizing the next major version of the engine."
    },
    {
      "username": "standujar",
      "avatarUrl": "https://avatars.githubusercontent.com/u/16385918?u=718bdcd1585be8447bdfffb8c11ce249baa7532d&v=4",
      "totalScore": 31.938,
      "prScore": 0,
      "issueScore": 0,
      "reviewScore": 31.5,
      "commentScore": 0.43799999999999994,
      "summary": "standujar: Focused exclusively on large-scale bugfix work this week, executing substantial code modifications across 239 files with over 11,000 lines of total churn. They also played a significant role in quality assurance by providing 6 detailed pull request reviews, including three critical change requests and seven technical comments. Their primary impact centered on stabilizing the codebase through extensive file-level corrections and rigorous peer feedback."
    },
    {
      "username": "matomoniwano",
      "avatarUrl": "https://avatars.githubusercontent.com/u/47988393?u=2e31304db3ca7b0a1f62bc26443c25ec34bb519d&v=4",
      "totalScore": 29.89251334905818,
      "prScore": 29.69251334905818,
      "issueScore": 0,
      "reviewScore": 0,
      "commentScore": 0.2,
      "summary": "matomoniwano: Focused on architectural expansion by developing a prototype for the RLM provider within the Eliza Python core, as seen in the ongoing work for PR #6383. This effort involved substantial modifications across 16 files (+610/-223 lines), prioritizing the foundational infrastructure required for this new integration. Their primary focus this week centered on configuration, documentation, and testing to ensure a robust framework for the prototype."
    },
    {
      "username": "greptile-apps",
      "avatarUrl": "https://avatars.githubusercontent.com/in/867647?v=4",
      "totalScore": 27.2,
      "prScore": 0,
      "issueScore": 0,
      "reviewScore": 27,
      "commentScore": 0.2,
      "summary": "greptile-apps: Focused exclusively on collaborative quality assurance this week, contributing five reviews and one pull request comment across the codebase. While no code was merged or issues opened, their activity centered on providing feedback and technical oversight through the review process. Their primary impact was driven by peer review and maintaining development standards rather than direct code contributions."
    },
    {
      "username": "project-aeris-disaster-agent",
      "avatarUrl": "https://avatars.githubusercontent.com/u/242933833?v=4",
      "totalScore": 14.346573590279972,
      "prScore": 14.346573590279972,
      "issueScore": 0,
      "reviewScore": 0,
      "commentScore": 0,
      "summary": null
    },
    {
      "username": "Xayaan",
      "avatarUrl": "https://avatars.githubusercontent.com/u/5237930?u=7840b286463bde982c8af8f389e61e26a01328cb&v=4",
      "totalScore": 14.346573590279972,
      "prScore": 14.346573590279972,
      "issueScore": 0,
      "reviewScore": 0,
      "commentScore": 0,
      "summary": null
    },
    {
      "username": "shuhaib112",
      "avatarUrl": "https://avatars.githubusercontent.com/u/211030292?v=4",
      "totalScore": 9,
      "prScore": 0,
      "issueScore": 0,
      "reviewScore": 9,
      "commentScore": 0,
      "summary": "shuhaib112: Focused on collaborative quality assurance by providing two reviews on open pull requests. This engagement indicates a focus on maintaining code standards and supporting peer contributions through technical feedback. Their primary activity this week centered on the review process rather than direct code implementation."
    },
    {
      "username": "ChristopherTrimboli",
      "avatarUrl": "https://avatars.githubusercontent.com/u/27584221?u=0d816ce1dcdea8f925aba18bb710153d4a87a719&v=4",
      "totalScore": 5,
      "prScore": 0,
      "issueScore": 0,
      "reviewScore": 5,
      "commentScore": 0,
      "summary": "ChristopherTrimboli: Focused on a mix of general maintenance and bugfix work this week, contributing eight commits that modified 50 files with a balanced volume of code changes (+489/-574 lines). They also supported the team's development flow by providing a pull request approval, ensuring continued progress on peer contributions. Their primary efforts were centered on system stability and addressing technical debt through various file updates."
    },
    {
      "username": "borisudovicic",
      "avatarUrl": "https://avatars.githubusercontent.com/u/31806472?u=8935f4d43fd7e4eb9bf5ff92d54d4d2f8ac8a786&v=4",
      "totalScore": 4,
      "prScore": 0,
      "issueScore": 4,
      "reviewScore": 0,
      "commentScore": 0,
      "summary": "borisudovicic: Focused on product refinement and feature definition for the elizaos/eliza ecosystem, driving the implementation of an agent discovery module (#6302) and establishing a standardized public agent link format (#6304). They also actively managed the platform's stability and user experience by identifying dashboard bugs (#6382) and proposing interface simplifications in the app builder (#6385). Their primary impact this week centered on project management and triaging issues related to the landing page and dashboard functionality."
    },
    {
      "username": "lalalune",
      "avatarUrl": "https://avatars.githubusercontent.com/u/18633264?u=e2e906c3712c2506ebfa98df01c2cfdc50050b30&v=4",
      "totalScore": 0.43799999999999994,
      "prScore": 0,
      "issueScore": 0,
      "reviewScore": 0,
      "commentScore": 0.43799999999999994,
      "summary": "lalalune: Executed a massive codebase cleanup and restructuring, contributing a single high-impact commit that modified 776 files with over 74,000 total lines of changes. While they did not merge any pull requests, they remained engaged in the development process by providing three targeted comments on ongoing pull requests. Their primary focus this week was centered on large-scale repository maintenance and file-level refactoring."
    }
  ],
  "newPRs": 0,
  "mergedPRs": 0,
  "newIssues": 0,
  "closedIssues": 0,
  "activeContributors": 5
}